src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ВидыОперацийЗаказаПокупателя/ВидыОперацийЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказаПокупателя</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ПредложениеПоставщика/ПредложениеПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПредложениеПоставщика</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредложения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Победитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставкиДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ТехнологическаяКарта/ТехнологическаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТехнологическаяКарта</name>
  <registerRecords>InformationRegister.СоставТехКарты</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособИзготовления</name>
      <type>
        <types>EnumRef.СпособыИзготовления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПотерь</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

// Номенклатура строки товаров в начале редактирования: материалы очищаются при окончании
// редактирования, если номенклатура сменилась и редактирование не отменили.
&НаКлиенте
Перем НоменклатураДоРедактирования;

// Редактирование строки товаров отменили: количество вернулось, материалы пересчитываются отложенно.
&НаКлиенте
Перем ПересчитатьПослеОтмены;

#КонецОбласти

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	ДСОбсуждение.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	УстановитьВидЦеныПоДоговору();	
	УстановитьЗаголовок(Объект);
	ЕстьПравоЗаверениеЦен = РегистрыСведений.НастройкиПользователей.ЗаверениеЦен(); 
	Элементы.ДекорацияСтатусаЗаказа.Заголовок = Строка(РаботаСДокументамиВызовСервера.ПолучитьСтатусЗаказПокупателя(Объект.Ссылка));  
	Элементы.МенеджерПодтвердилПроверилОстаток.Доступность = НЕ объект.МенеджерПодтвердилПроверилОстаток;
	НастроитьФорму(); 
	ЗаполнитьСуммыОплатыДолга();
	ЗаполнитьОстаткиНаСервере();
	Если ЕстьПравоЗаверениеЦен Тогда
		ЗаполнитьПоследниеЦены();
	КонецЕсли;
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
	ЗаполнитьДанныеТендера();
	РаботаСДокументами.ОграничитьВидимостьРеквизитовПоТипу(ЭтотОбъект, "ОператорПроизводства");
	НастроитьМатериалы();
	НастроитьПроведение(Объект.Проведен);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина);
	ПрименитьОтборМатериалов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	УстановитьЗаголовок(ТекущийОбъект);
	ЗаполнитьОстаткиНаСервере();
	НастроитьМатериалы();
	// Данные формы к этому моменту старые: проведённость - по записанному объекту.
	НастроитьПроведение(ТекущийОбъект.Проведен);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Запись могла переномеровать коды строк товаров и очистить материалы.
	ПрименитьОтборМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидОперацииПриИзмененииНаСервере();
	ПрименитьОтборМатериалов();
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	УстановитьЗаголовок(Объект);
	НастроитьМатериалы();
	НастроитьПроведение(Объект.Проведен);
	Если Не ЭтоЗаказНаПроизводство И Объект.ТЧМатериалы.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Заказ не на производство: материалы будут очищены при записи';
				|fr = 'La commande n''est pas en production : les matières seront effacées à l''enregistrement';
				|en = 'The order is not a production order: materials will be cleared on save';
				|es = 'El pedido no es de producción: los materiales se borrarán al guardar'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	ПересчитатьСтрокиПоРежимуНДС();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	//РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// У существующей строки и у копии (с материалами исходной строки) запоминается номенклатура;
	// у пустой новой строки материалов нет - сравнивать не с чем.
	НоменклатураДоРедактирования = Неопределено;
	Если (Не НоваяСтрока Или Копирование) И Элемент.ТекущиеДанные <> Неопределено Тогда
		НоменклатураДоРедактирования = Элемент.ТекущиеДанные.Номенклатура;
	КонецЕсли;
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		// При копировании в строке ещё код исходной строки: по нему копируются материалы.
		КодИсходнойСтроки = ТекСтр.КодСтроки;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;
		Если ЭтоЗаказНаПроизводство Тогда
			// Материалы с новым кодом могли остаться от строки, добавление которой отменили.
			УдалитьМатериалыСтроки(ТекСтр.КодСтроки);
			Если Копирование Тогда
				СкопироватьМатериалыСтроки(КодИсходнойСтроки, ТекСтр.КодСтроки);
			КонецЕсли;
			ПрименитьОтборМатериалов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не ЭтоЗаказНаПроизводство Тогда
		Возврат;
	КонецЕсли;
	// Смена номенклатуры очищает материалы только принятым редактированием: после Esc платформа
	// возвращает строке прежнюю номенклатуру, а удалённые материалы вернуть было бы нечем.
	ТекСтр = Элемент.ТекущиеДанные;
	РедактированиеПринято = Не ОтменаРедактирования И ТекСтр <> Неопределено;
	Если РедактированиеПринято И НоменклатураСменилась(ТекСтр) Тогда
		ОчиститьМатериалыСтрокиТоваров(ТекСтр);
	КонецЕсли;
	НоменклатураДоРедактирования = Неопределено;
	// Отменённая строка удаляется из коллекции после события, отменённое количество тоже
	// возвращается позже: материалы согласуются следом. Пересчёт - только после отмены: принятое
	// количество уже пересчитали обработчики изменения, лишний вызов сервера не нужен.
	ПересчитатьПослеОтмены = ОтменаРедактирования;
	ЗадержкаСекунд = 0.1;
	ПодключитьОбработчикОжидания("СогласоватьМатериалыПослеРедактирования", ЗадержкаСекунд, Истина);
КонецПроцедуры

&НаКлиенте
Функция НоменклатураСменилась(СтрокаТоваров)
	Возврат НоменклатураДоРедактирования <> Неопределено И СтрокаТоваров.Номенклатура <> НоменклатураДоРедактирования;
КонецФункции

&НаКлиенте
Процедура СогласоватьМатериалыПослеРедактирования() Экспорт
	УдалитьМатериалыБезСтрокТоваров();
	Если ТипЗнч(ПересчитатьПослеОтмены) = Тип("Булево") И ПересчитатьПослеОтмены Тогда
		ПересчитатьМатериалыСтроки(Элементы.ТЧТовары.ТекущиеДанные);
	КонецЕсли;
	ПересчитатьПослеОтмены = Ложь;
	ПрименитьОтборМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПослеУдаления(Элемент)
	Если Не ЭтоЗаказНаПроизводство Тогда
		Возврат;
	КонецЕсли;
	УдалитьМатериалыБезСтрокТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииСтроки(Элемент)
	ПрименитьОтборМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
	Если ЕстьПравоЗаверениеЦен Тогда
		ЗаполнитьПоследниеЦеныСтроки(Элементы.ТЧТовары.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
	ПересчитатьМатериалыСтроки(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
	ПересчитатьМатериалыСтроки(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСкидкаНаЦенуПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ДСОбсуждениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	РаботаСДокументамиКлиент.ДобавитьКомментарий(Объект.Ссылка, ПолучитьАдресатаОбсуждения());
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно
	
&НаСервере
Процедура УстановитьЦеныНаСервере()
	// Цены на дату документа, как в остальных документах продаж (решение владельца 2026-09-07).
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата, Объект.ЦенаВключаетНДС,
		Объект.Контрагент);		
КонецПроцедуры 

&НаСервере
Функция ПолучитьАдресатаОбсуждения()
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.Пользователи.ПолучитьПоСотруднику(Объект.Менеджер);	
КонецФункции	

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	//ВидЦены = ?(ЗначениеЗаполнено(Объект.Договор.ВидЦены),Объект.Договор.ВидЦены, Справочники.ВидыЦен.Розничная);
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены),Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
	Объект.ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(ВидЦены);
КонецПроцедуры

// Заголовок формы: заказ на производство называется по виду операции, продажа - синонимом документа.
//
// Параметры:
//  ДанныеОбъекта - ДанныеФормыСтруктура, ДокументОбъект.ЗаказПокупателя - после записи передаётся
//                  записанный объект: номер и ссылка в данных формы к этому моменту ещё старые
//
&НаСервере
Процедура УстановитьЗаголовок(ДанныеОбъекта)
	ЗаголовокФормы = "";
	Если ДанныеОбъекта.ВидОперации = Перечисления.ВидыОперацийЗаказаПокупателя.Производство Тогда
		ЗаголовокФормы = НСтр("ru = 'Заказ клиента на производство'; fr = 'Commande client en production';
			|en = 'Customer production order'; es = 'Pedido de cliente para producción'");
	КонецЕсли;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ДанныеОбъекта, ЗаголовокФормы);
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	Элементы.ТЧТоварыГруппаПоследниеЦены.Видимость = ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыВидЦены.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыЦена.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСумма.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыПроцентСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСуммаСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоследниеЦены(Знач Строка = Неопределено)
	РаботаСДокументами.ЗаполнитьПоследниеЦены(Объект, Строка);
	Возврат Строка;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоследниеЦеныСтроки(ТекСтр)
	СтрСтруктура = РаботаСДокументамиКлиентСервер.ПреобразоватьСтрокуТаблицыВСтруктуру(ТекСтр, Объект);
	СтрСтруктура = ЗаполнитьПоследниеЦены(СтрСтруктура);
	ЗаполнитьЗначенияСвойств(ТекСтр, СтрСтруктура, "ЦенаЗакупкиПоследняя, ЦенаПродажиПоследняя, ПроцентНаценкиНаЦену");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентНаценкиНаЦенуПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ТекСтр.Цена = ТекСтр.ЦенаЗакупкиПоследняя
		* (1 + ТекСтр.ПроцентНаценкиНаЦену / РаботаСДокументамиКлиентСервер.СтоПроцентов());
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(ТекСтр, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыОплатыДолга()    
	
		СуммаДолга = "0,00";        
		СуммаОплаты  = "0,00"; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчётыСПокупателями.ОбъектРасчётов КАК ОбъектРасчётов,
	|	ВзаиморасчётыСПокупателями.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПокупателями КАК ВзаиморасчётыСПокупателями
	|ГДЕ
	|	ВзаиморасчётыСПокупателями.ОбъектРасчётов.Основание = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);  
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() = 0 Тогда иначе

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов КАК ОбъектРасчётов,
		               |	ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(, ОбъектРасчётов.Основание = &Ссылка) КАК ВзаиморасчётыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);  
	
		Выборка = Запрос.Выполнить().Выгрузить();
	
		СуммаДолга = Строка(Выборка.Итог("Сумма"));        
		СуммаОплаты  = Строка(объект.Сумма - Выборка.Итог("Сумма")); 
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	// У заказа нет склада: остаток по складу пользователя
	МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	РегистрыНакопления.ТоварыВНаличии.ЗаполнитьОстаткиСтрок(Объект.ТЧТовары, МестоХранения);
КонецПроцедуры

&НаКлиенте
Процедура ПредложенияПоставщиков(Команда)
	Отбор = Новый Структура("ЗаказПокупателя", Объект.Ссылка);
	ОткрытьФорму("Документ.ПредложениеПоставщика.Форма.ФормаСписка", Новый Структура("Отбор", Отбор), ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТендера()
	// Кнопка и декорация тендера привязаны к функциональной опции «Тендеры поставщиков»:
	// при выключенной опции платформа убирает их с формы совсем, поэтому сначала ищем.
	// В декорации - число предложений по заказу и победитель, если он выбран.
	КнопкаПредложений = Элементы.Найти("КнопкаПредложенияПоставщиков");
	ДекорацияТендера = Элементы.Найти("ДекорацияТендер");
	Если КнопкаПредложений = Неопределено Или ДекорацияТендера = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТендерыВключены = ПолучитьФункциональнуюОпцию("ТендерыПоставщиков");
	КнопкаПредложений.Видимость = ТендерыВключены;
	ДекорацияТендера.Видимость = Ложь;
	Если Не ТендерыВключены Или Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ТЗПредложения = Документы.ПредложениеПоставщика.ПредложенияЗаказа(Объект.Ссылка);
	Если ТЗПредложения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ДекорацияТендера.Видимость = Истина;
	МасПобедители = ТЗПредложения.НайтиСтроки(Новый Структура("Победитель", Истина));
	Если МасПобедители.Количество() > 0 Тогда
		Шаблон = НСтр("fr = 'Appel d''offres : %1 offre(s), gagnant - %2';
			|ru = 'Тендер: %1 предложений, победитель - %2';
			|en = 'Tender: %1 offers, winner - %2';
			|es = 'Licitación: %1 ofertas, ganador - %2'");
		ДекорацияТендера.Заголовок = СтрШаблон(Шаблон, ТЗПредложения.Количество(), МасПобедители[0].Поставщик);
	Иначе
		Шаблон = НСтр("fr = 'Appel d''offres : %1 offre(s), gagnant non choisi';
			|ru = 'Тендер: %1 предложений, победитель не выбран';
			|en = 'Tender: %1 offers, winner not selected';
			|es = 'Licitación: %1 ofertas, ganador no elegido'");
		ДекорацияТендера.Заголовок = СтрШаблон(Шаблон, ТЗПредложения.Количество());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, Ложь);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,, ВидЦены,ЭтаФорма);
			ПересчитатьВсеМатериалы();
			ПрименитьОтборМатериалов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиПоРежимуНДС()
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , ВидЦены, ЭтотОбъект);
		ПересчитатьВсеМатериалы();
		ПрименитьОтборМатериалов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧМатериалы

&НаКлиенте
Процедура РежимМатериаловПриИзменении(Элемент)
	ПрименитьОтборМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ТЧМатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	СтрокаТоваров = Элементы.ТЧТовары.ТекущиеДанные;
	Если СтрокаТоваров = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстВыберитеСтрокуТоваров(), , , , Отказ);
		Возврат;
	КонецЕсли;
	// Повторяющийся код остаётся у первой строки с этим кодом, как при записи заказа.
	Отбор = Новый Структура("КодСтроки", СтрокаТоваров.КодСтроки);
	СтрокиСКодом = Объект.ТЧТовары.НайтиСтроки(Отбор);
	КодЗанятПредыдущейСтрокой = СтрокиСКодом.Количество() > 1 И СтрокиСКодом[0] <> СтрокаТоваров;
	Если СтрокаТоваров.КодСтроки = 0 Или КодЗанятПредыдущейСтрокой Тогда
		СтрокаТоваров.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ПрименитьОтборМатериалов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧМатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	Материал = Элемент.ТекущиеДанные;
	Материал.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧМатериалы);
	// Новая строка и копия относятся к продукции, на которой стоит пользователь, в обоих режимах.
	СтрокаТоваров = Элементы.ТЧТовары.ТекущиеДанные;
	Если СтрокаТоваров <> Неопределено Тогда
		Материал.КодСтрокиПродукции = СтрокаТоваров.КодСтроки;
		ПересчитатьСтрокуМатериала(Материал, СтрокаТоваров.Количество);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧМатериалыНоменклатураПриИзменении(Элемент)
	Материал = Элементы.ТЧМатериалы.ТекущиеДанные;
	Материал.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	// Материал по карте получает упаковку карты только при опции «Использовать упаковку»; вручную
	// введённый - единицу материала на тех же условиях, иначе ключ состава разошёлся бы с картой.
	Материал.Упаковка = УпаковкаМатериалаПоУмолчанию(Материал.Номенклатура);
	ПересчитатьТекущийМатериал();
КонецПроцедуры

// Упаковка вручную введённого материала.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - материал.
//
// Возвращаемое значение:
//  СправочникСсылка.УпаковкиЕдиницыИзмерения - единица материала при опции «Использовать упаковку», иначе пустая.
//
&НаСервереБезКонтекста
Функция УпаковкаМатериалаПоУмолчанию(Знач Номенклатура)
	Если Не ЗначениеЗаполнено(Номенклатура) Или Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковку") Тогда
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "Единица");
КонецФункции

&НаКлиенте
Процедура ТЧМатериалыУпаковкаПриИзменении(Элемент)
	ПересчитатьТекущийМатериал();
КонецПроцедуры

&НаКлиенте
Процедура ТЧМатериалыКоличествоЗаЕдиницуПриИзменении(Элемент)
	ПересчитатьТекущийМатериал();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьМатериалыПоТехкарте(Команда)
	Если Элементы.ТЧТовары.ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстВыберитеСтрокуТоваров());
		Возврат;
	КонецЕсли;
	ЗаполнитьМатериалыНаСервере(Элементы.ТЧТовары.ТекущаяСтрока);
	ПослеЗаполненияМатериалов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеМатериалыПоТехкартам(Команда)
	Если Объект.ТЧМатериалы.Количество() = 0 Тогда
		ЗаполнитьМатериалыНаСервере(Неопределено);
		ПослеЗаполненияМатериалов();
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьВсеМатериалыПослеВопроса", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Перезаполнить материалы всех строк по техкартам? Ручные изменения материалов будут потеряны.';
		|fr = 'Remplir à nouveau les matières de toutes les lignes selon les gammes de fabrication ? Les modifications manuelles seront perdues.';
		|en = 'Refill the materials of all lines from production routings? Manual changes to materials will be lost.';
		|es = '¿Volver a rellenar los materiales de todas las líneas según las rutas de fabricación? Se perderán los cambios manuales.'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
КонецПроцедуры

// Обработчик ответа на вопрос о перезаполнении материалов всех строк.
//
// Параметры:
//  Ответ                   - КодВозвратаДиалога - ответ пользователя.
//  ДополнительныеПараметры - Неопределено - не используется.
//
&НаКлиенте
Процедура ЗаполнитьВсеМатериалыПослеВопроса(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьМатериалыНаСервере(Неопределено);
	ПослеЗаполненияМатериалов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Материалы видны только у заказа на производство при включённой опции «Производство»; признак
// нужен и клиентским обработчикам: у продаж поведение формы не меняется.
//
&НаСервере
Процедура НастроитьМатериалы()
	ЭтоЗаказНаПроизводство = ПолучитьФункциональнуюОпцию("Производство")
		И Объект.ВидОперации = Перечисления.ВидыОперацийЗаказаПокупателя.Производство;
	// При выключенной опции элементы реквизитов опции могут отсутствовать - сначала ищем.
	Для Каждого ИмяЭлемента Из СтрРазделить("ГруппаМатериалы,ТЧТоварыТехкарта", ",") Цикл
		Элемент = Элементы.Найти(ИмяЭлемента);
		Если Элемент <> Неопределено Тогда
			Элемент.Видимость = ЭтоЗаказНаПроизводство;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проводится только заказ на производство (E6): у продажи команды проведения скрыты, главная кнопка -
// «Записать и закрыть», как до включения проведения. Вид операции проведённого заказа не меняется.
//
// Параметры:
//  Проведен - Булево - проведён ли заказ.
//
&НаСервере
Процедура НастроитьПроведение(Проведен)
	Проводится = Документы.ЗаказПокупателя.ЗаказПроводится(Объект.ВидОперации);
	Элементы.ФормаПровестиИЗакрыть.Видимость = Проводится;
	Элементы.ФормаПровести.Видимость = Проводится;
	Элементы.ФормаЗаписатьИЗакрыть.Видимость = Не Проводится;
	Элементы.ФормаОтменаПроведения.Видимость = Проведен;
	Если Проводится Тогда
		Элементы.ФормаПровестиИЗакрыть.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаЗаписатьИЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	Элементы.ВидОперации.ТолькоПросмотр = Проведен;
КонецПроцедуры

// Режим «по строке товаров» показывает материалы текущей строки товаров, «все материалы» - без отбора.
//
&НаКлиенте
Процедура ПрименитьОтборМатериалов()
	Если Не ЭтоЗаказНаПроизводство Тогда
		Возврат;
	КонецЕсли;
	Если РежимМатериалов = 1 Тогда
		Элементы.ТЧМатериалы.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	СтрокаТоваров = Элементы.ТЧТовары.ТекущиеДанные;
	КодСтроки = ?(СтрокаТоваров = Неопределено, -1, СтрокаТоваров.КодСтроки);
	Элементы.ТЧМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура("КодСтрокиПродукции", КодСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМатериалыСтроки(КодСтроки)
	Материалы = Объект.ТЧМатериалы.НайтиСтроки(Новый Структура("КодСтрокиПродукции", КодСтроки));
	Для Каждого Материал Из Материалы Цикл
		Объект.ТЧМатериалы.Удалить(Материал);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьМатериалыСтроки(КодИсходнойСтроки, КодНовойСтроки)
	Исходные = Объект.ТЧМатериалы.НайтиСтроки(Новый Структура("КодСтрокиПродукции", КодИсходнойСтроки));
	КодМатериала = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧМатериалы);
	Для Каждого Исходный Из Исходные Цикл
		Материал = Объект.ТЧМатериалы.Добавить();
		ЗаполнитьЗначенияСвойств(Материал, Исходный);
		Материал.КодСтроки = КодМатериала;
		Материал.КодСтрокиПродукции = КодНовойСтроки;
		КодМатериала = КодМатериала + 1;
	КонецЦикла;
КонецПроцедуры

// Удаляет материалы, чьей строки товаров больше нет. Вызывается и обработчиком ожидания после
// отмены добавления строки товаров.
//
&НаКлиенте
Процедура УдалитьМатериалыБезСтрокТоваров() Экспорт
	КодыТоваров = Новый Соответствие;
	Для Каждого СтрокаТоваров Из Объект.ТЧТовары Цикл
		КодыТоваров.Вставить(СтрокаТоваров.КодСтроки, Истина);
	КонецЦикла;
	Индекс = Объект.ТЧМатериалы.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Материал = Объект.ТЧМатериалы[Индекс];
		Если КодыТоваров[Материал.КодСтрокиПродукции] = Неопределено Тогда
			Объект.ТЧМатериалы.Удалить(Материал);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
КонецПроцедуры

// Смена номенклатуры строки товаров: материалы и версия карты относились к прежней продукции.
//
// Параметры:
//  СтрокаТоваров - ДанныеФормыЭлементКоллекции, Неопределено - строка товаров.
//
&НаКлиенте
Процедура ОчиститьМатериалыСтрокиТоваров(СтрокаТоваров)
	Если Не ЭтоЗаказНаПроизводство Или СтрокаТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если СтрокаТоваров.КодСтроки <> 0 Тогда
		УдалитьМатериалыСтроки(СтрокаТоваров.КодСтроки);
	КонецЕсли;
	СтрокаТоваров.Техкарта = ПредопределенноеЗначение("Документ.ТехнологическаяКарта.ПустаяСсылка");
КонецПроцедуры

// Та же формула, что Документы.ЗаказПокупателя.ПересчитатьСтрокуМатериала на сервере.
//
// Параметры:
//  Материал            - ДанныеФормыЭлементКоллекции - строка материалов.
//  КоличествоПродукции - Число - количество строки товаров в базовых единицах.
//
&НаКлиенте
Процедура ПересчитатьСтрокуМатериала(Материал, КоличествоПродукции)
	Материал.КоличествоУпаковок = Материал.КоличествоЗаЕдиницу * КоличествоПродукции;
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(Материал);
КонецПроцедуры

// Без упаковок пересчёт идёт на клиенте без обращений к серверу; если у материалов строки есть
// упаковки, коэффициенты считаются на сервере одним вызовом (пересчитываются материалы всего заказа -
// пересчёт идемпотентен), а не вызовом на каждый материал.
//
// Параметры:
//  СтрокаТоваров - ДанныеФормыЭлементКоллекции, Неопределено - строка товаров.
//
&НаКлиенте
Процедура ПересчитатьМатериалыСтроки(СтрокаТоваров)
	Если Не ЭтоЗаказНаПроизводство Или СтрокаТоваров = Неопределено Или СтрокаТоваров.КодСтроки = 0 Тогда
		Возврат;
	КонецЕсли;
	Материалы = Объект.ТЧМатериалы.НайтиСтроки(Новый Структура("КодСтрокиПродукции", СтрокаТоваров.КодСтроки));
	Для Каждого Материал Из Материалы Цикл
		Если ЗначениеЗаполнено(Материал.Упаковка) Тогда
			ПересчитатьВсеМатериалыНаСервере();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Материал Из Материалы Цикл
		ПересчитатьСтрокуМатериала(Материал, СтрокаТоваров.Количество);
	КонецЦикла;
КонецПроцедуры

// Подбор и штрихкод меняют несколько строк сразу: пересчёт одним вызовом сервера, а не вызовом
// коэффициента упаковки на каждый материал с клиента. Подбор и штрихкод могли добавить строку с
// нулевым кодом - коды строк товаров здесь не трогаются.
//
&НаКлиенте
Процедура ПересчитатьВсеМатериалы()
	Если Не ЭтоЗаказНаПроизводство Или Объект.ТЧМатериалы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПересчитатьВсеМатериалыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВсеМатериалыНаСервере()
	Для Каждого Материал Из Объект.ТЧМатериалы Цикл
		СтрокиТоваров = Объект.ТЧТовары.НайтиСтроки(Новый Структура("КодСтроки", Материал.КодСтрокиПродукции));
		КоличествоПродукции = ?(СтрокиТоваров.Количество() = 0, 0, СтрокиТоваров[0].Количество);
		Документы.ЗаказПокупателя.ПересчитатьСтрокуМатериала(Материал, КоличествоПродукции);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТекущийМатериал()
	Материал = Элементы.ТЧМатериалы.ТекущиеДанные;
	Если Материал = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокиТоваров = Объект.ТЧТовары.НайтиСтроки(Новый Структура("КодСтроки", Материал.КодСтрокиПродукции));
	КоличествоПродукции = ?(СтрокиТоваров.Количество() = 0, 0, СтрокиТоваров[0].Количество);
	ПересчитатьСтрокуМатериала(Материал, КоличествоПродукции);
КонецПроцедуры

&НаКлиенте
Функция ТекстВыберитеСтрокуТоваров()
	Возврат НСтр("ru = 'Выберите строку товаров, к которой относятся материалы';
		|fr = 'Sélectionnez la ligne d''articles à laquelle se rapportent les matières';
		|en = 'Select the product line the materials belong to';
		|es = 'Seleccione la línea de artículos a la que pertenecen los materiales'");
КонецФункции

// Серверная часть команд заполнения: данные формы, а не объект, чтобы не сбросить дополнительные
// колонки товаров (остатки, последние цены).
//
// Параметры:
//  ИдентификаторСтроки - Число, Неопределено - строка товаров; не задан - все строки.
//
&НаСервере
Процедура ЗаполнитьМатериалыНаСервере(Знач ИдентификаторСтроки)
	Строки = Неопределено;
	Если ИдентификаторСтроки <> Неопределено Тогда
		Строки = Новый Массив;
		Строки.Добавить(Объект.ТЧТовары.НайтиПоИдентификатору(ИдентификаторСтроки));
	КонецЕсли;
	Документы.ЗаказПокупателя.ЗаполнитьМатериалыПоТехкартам(Объект.ТЧТовары, Объект.ТЧМатериалы, Объект.Дата,
		Строки, Строки = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияМатериалов()
	Модифицированность = Истина;
	ПрименитьОтборМатериалов();
КонецПроцедуры

#КонецОбласти
